app/views/articles/_form.html.erb


<%= collection_select(:article, :author_id, Author.all, :id, :name) %>

<%= collection_check_boxes(:article, :tag_ids, Tag.all, :id, :name) %>
---
SELECT "authors".* FROM "authors"
SELECT "tags".* FROM "tags"