app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "article six"], ["body", "new article"], ["created_at", "2016-03-23 18:07:06.920170"], ["updated_at", "2016-03-23 18:07:06.920170"]]

  def update
    if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Article uno"], ["updated_at", "2016-03-23 18:05:11.176599"], ["id", 1]]

  def find_article
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 6]]