app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)

    if @author.save
---
INSERT INTO "authors" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Daniel"], ["last_name", ""], ["created_at", "2016-03-23 19:03:47.861768"], ["updated_at", "2016-03-23 19:03:47.861768"]]

  def update
    if @author.update(author_params)
---
UPDATE "authors" SET "first_name" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["first_name", "Daniel"], ["updated_at", "2016-03-23 19:07:33.959002"], ["id", 1]]

  def destroy
    @author.destroy
---
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 2]]

  def find_author
    @author = Author.find(params[:id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 2]]