app/controllers/tags_controller.rb

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "post2"], ["created_at", "2016-03-23 19:03:34.896360"], ["updated_at", "2016-03-23 19:03:34.896360"]]
---
  def create
    @tag = Tag.new(tag_params)

    if @tag.save

UPDATE "tags" SET "name" = ?, "updated_at" = ? WHERE "tags"."id" = ?  [["name", "post2"], ["updated_at", "2016-03-23 19:07:21.612366"], ["id", 1]]
---
  def update
    if @tag.update(tag_params)

DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 2]]
---
  def destroy
    @tag.destroy

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 2]]
---
  def find_tag
    @tag = Tag.find(params[:id])